tutorials/multiRegion/film/cylinderDripping/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s fluid blockMesh -region fluid

runApplication extrudeToRegionMesh -region fluid -overwrite

printf "\n%s\n" "Creating files for paraview post-processing"
paraFoam -touchAll
echo

runApplication $(getApplication)

#------------------------------------------------------------------------------
